# Create Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
Document..::..Create Property
Document Class See Also
---
An object that can be used to create new instances of Autodesk Revit API elements within a project.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public Document Create { get; }
```

Visual Basic
---
```text
Public ReadOnly Property Create As Document
	Get
```

Visual C++
---
```text
public:
property Document^ Create {
	Document^ get ();
}
```

# ### Field Value
This object is used to create new instances of project elements within the Autodesk Revit API, such as FamilyInstances or groups.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..InvalidOperationException | Thrown when the current document is family document. |

# See Also
Document Class
Autodesk.Revit.DB Namespace